app/controllers/products_controller.rb

  def index
    @product = Product.all
---
SELECT `products`.* FROM `products`

  def create
    @product = Product.create(product_params)
---
INSERT INTO `products` (`product`, `created_at`, `updated_at`) VALUES ('{\"product\"=>\"鳥\"}', '2019-04-17 09:57:50', '2019-04-17 09:57:50')

  def update
    @product.update(product_params)
---
UPDATE `products` SET `product` = '猿', `updated_at` = '2019-04-17 10:27:29' WHERE `products`.`id` = 4

  def destroy
    if @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 4